// --------------------------------------------------------------------------
// 연습: 다음 정보를 변수와 상수로 저장하고 콘솔에 출력하세요.
// --------------------------------------------------------------------------
// - 이름(상수)
const MY_NAME = '장예지'
// - 나이(변수)
let myAge = 30
// - 학생 여부(상수)
const STUDENT_STATUS = 'No'
// - 모든 정보를 한 번에 출력해보세요.
console.log('이름:', MY_NAME, '학생여부:', STUDENT_STATUS, '나이:', myAge)

// --------------------------------------------------------------------------
// 연습: 다음 계산을 변수를 사용하여 수행하세요.
// --------------------------------------------------------------------------
// - 숫자1(상수)
const NUMBER_1 = 1 
// - 숫자2(상수)
const NUMBER_2 = 2
// - 결과(변수)
let result = NUMBER_1 + NUMBER_2
console.log(result)

// --------------------------------------------------------------------------
// 연습: 다음 쇼핑 정보를 변수로 관리하세요.
// --------------------------------------------------------------------------
// - 상품명(상수)
const PRODUCT_NAME = '사과'
// - 가격(변수)
let productPrice = 50000
// - 재고 있음(변수)
let inventory = '있음'
// - 할인율(상수)
const Discount_Rate = 0.1
console.log('상품명:', PRODUCT_NAME,'재고 유무:', inventory, '할인율:', Discount_Rate)