//숫자(number) 값 (number value or literal)
//실수
101;
//정수
98;
//소수
1.07;
//둘 two(문자로 숫자를 입력할 수 없다.)

//------------------------------
//문자(string) 값
//작은 따옴표(')
("2px");
//큰 따옴표(')
//프로그램 문장이 끝날 때 마침을 의미하는 세미콜론 추가
("2inch");
// 역 따옴표 (`)
`2inch`;
//---------------------------------

//논리(boolean) 값
//->프로그램이 허용하지 않음 문자 ❌ (정의 되지 않은)
//참(Truthy,true)
//(Falsy,false)
//truthy;(안됨)
//falsy;(안됨)

true;
false;
//-> ✅ 프로그램이 허용하는 블리언 값

//--------------------------------
//터미널에 값 출력

//--------------------------------
// 주석 한 줄 (single comment)

/*
주석 여러 줄 (multiple comments)
CSS 주석과 유사
*/
