// --------------------------------------------------------------------------
// 연습 문제: 기본 타입 복사
// --------------------------------------------------------------------------
// 기본 타입의 값 복사 방식을 확인하세요.
//
// 조건:
// 1. num1 변수에 100 할당
// 2. num2 변수에 num1 값 복사
// 3. num1 변수를 200으로 변경
// 4. num1 변수 출력
// 5. num2 변수 출력

// [작성 공간]
let num1 = 100
let num2 = num1
num1 = 200
console.log(num1)
console.log(num2)



// --------------------------------------------------------------------------
// 연습 문제: 객체 타입 복사
// --------------------------------------------------------------------------
// 객체 타입의 주소 복사 방식을 확인하세요.
//
// 조건:
// 1. car1 객체 생성 (brand 속성: 'Tesla', model 속성: 'Model 3')
// 2. car2 변수에 car1 객체 할당 (주소 복사)
// 3. car2 객체의 model 속성을 'Model S'로 변경
// 4. car1 객체 출력
// 5. car2 객체 출력

// [작성 공간]
let car1 = {
  'brand 속성': 'Tesla', 
  'model 속성': 'Model 3'
}
let car2 = car1
console.log(car1)
console.log(car2)
console.log(car1 === car2)

// --------------------------------------------------------------------------
// 연습 문제: 객체 비교하기
// --------------------------------------------------------------------------
// 서로 다른 객체와 같은 객체를 비교하세요.
//
// 조건:
// 1. obj1 객체 생성 (value 속성: 10)
// 2. obj2 객체 생성 (value 속성: 10)
// 3. obj3 변수에 obj1 객체 할당
// 4. obj1과 obj2를 === 연산자로 비교한 결과 출력
// 5. obj1과 obj3를 === 연산자로 비교한 결과 출력

// [작성 공간]
let obj1 = {
  value: 10
}
let obj2 = {
  value: 10
}
let obj3 = obj1
console.log(obj1 === obj2) //false (동일한 값, 독립된 주소)
console.log(obj1 === obj3) // true (동일한 주소 공유)
